ticketing-backend/artillery/reservation-test.yml
config:
  target: 'http://localhost:3002'
  phases:
    - duration: 60
      arrivalRate: 700
      name: '예약 폭주 시나리오'
  payload:
    path: './reservation-test-payload.csv'
    fields:
      - userId
      - seatId
      - eventId
    format: json
  defaults:
    headers:
      Content-Type: application/json

scenarios:
  - name: '좌석 예약 요청'
    flow:
      - post:
          url: '/reservations'
          json:
            userId: '{{ userId }}'
            seatId: '{{ seatId }}'
            eventId: '{{ eventId }}'